<!-- dflook/terraform-github-actions {"workspace":"verify-2","backend":"1091b641985cec5b91ffccb0e5bfcbc922e3785872330c2a40cf5a99d677c4cd","backend_type":"remote","plan_job_ref":"Job Test Terraform cloud #72 at https://github.com/dflook/terraform-github-actions/actions/runs/3253215671","plan_hash":"fef119ed5d2d3284ab0041a7937d29d84e458577beaca1296f2172e0e62d6a2a","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __verify-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #72](https://github.com/dflook/terraform-github-actions/actions/runs/3253215671)